0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include 	"include/initialConditions";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0.01 0.01); //$flowVelocity?

boundaryField
{
    in
    {
        type            atmBoundaryLayerInletVelocity;
	#include 	"include/ABLConditions";
        value           uniform (1 0 0);
    }
    sideWall
    {
        type            empty;
    }
    bottomWall
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
        value           uniform (0 0 0);
    }
    upperWall
    {
        type            noSlip;
    }
    out
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
