0/W
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      W;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    in
    {
        type            fixedValue;
        value           uniform 0;
    }
    sideWall
    {
        type            empty;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            zeroGradient;
    }
    out
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
