0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include 	"include/initialConditions";

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    in
    {
        type            atmBoundaryLayerInletK;
	#include 	"include/ABLConditions";
        value           uniform $turbulentKE;
    }
    sideWall
    {
        type            empty;
    }
    bottomWall
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    out
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
