0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include 	"include/initialConditions";

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    in
    {
        type            zeroGradient;
    }
    sideWall
    {
        type            empty;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            zeroGradient;
    }
    out
    {
        type            fixedValue;
	value		uniform $pressure;
        //uniformValue    constant $pressure;
    }
}


// ************************************************************************* //
