constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    in
    {
        type            patch;
        nFaces          133;
        startFace       317867;
    }
    sideWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          319200;
        startFace       318000;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       637200;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       638400;
    }
    out
    {
        type            patch;
        nFaces          133;
        startFace       639600;
    }
)

// ************************************************************************* //
