system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//windTunnel advanced geometry

convertToMeters 1;

vertices
(

	(0 0 0) //0
	(16 0 0) //1
	(16 0.03 0) //2
	(0 0.03 0) //3

	(0 0 2) //4
	(16 0 2) //5
	(16 0.03 2) //6
	(0 0.03 2) //7


);
////////////////////////////////////////////////////////////////////////////////////////
blocks
(

	//hex (0 1 2 3 4 5 6 7) (360 100 80) simpleGrading (1 1 1) // 5 cm 
	//hex (0 1 2 3 4 5 6 7) (450 125 100) simpleGrading (1 1 1) // 4 cm 
	//hex (0 1 2 3 4 5 6 7) (600 167 133) simpleGrading (1 1 1) // 3 cm 
	hex (0 1 2 3 4 5 6 7) (1200 1 133) simpleGrading (1 1 10) // 3 cm // 2D

	
);

edges
(
);

boundary

(
	in //0
	{
		type patch;
		faces
		(
		(0 3 4 7)
		);
	}
	sideWall //1
	{
		type empty;
		faces
		(
		(0 1 5 4)
		(3 7 6 2)
		);
	}
	bottomWall //2
	{
		type wall;
		faces
		(
		(3 2 1 0)
		);
	}
	upperWall //3
	{
		type wall;
		faces
		(
		(4 5 6 7)
		);
	}
	out //5
	{
		type patch;
		faces
		(
		(1 2 6 5)
		);
	}
);

mergePairs
(
);





// ************************************************************************* //
